{
  "posts": [
    {
      "title": "Tour Of Murree",
      "body": "est rerum tempore vitae sequi sint nihil reprehenderit dolor beatae ea dolores neque fugiat blanditiis voluptate porro vel nihil molestiae ut reiciend Murree is a mountain resort city, located in the Galyat region of the Pir Panjal Range, within the Murree District of Punjab, Pakistan. It forms the outskirts of the Islamabad-Rawalpindi metropolitan area, and is about 30 km (19 mi) northeast of Islamabad. It has average altitude of 2,291 metres (7,516 ft). The British built this town during their rule to escape the scorching heat in the plains of Punjab during the summer.Construction of the town was started in 1851 on the hill of Murree as a sanatorium for British troops. The permanent town of Murree was constructed in 1853 and the church was consecrated shortly thereafter. One main road was established, commonly referred to even in modern times, as the mall. Murree was the summer headquarters of the colonial Punjab Government until 1876 when it was moved to Shimla.Murree became a popular tourist station for British citizens of the British Raj. Several prominent Britons were born here including Bruce Bairnsfather, Francis Younghusband, Reginald Dyer and Joanna Kelley. During the colonial era, access to commercial establishments was restricted for non-Europeans. Such establishments included Lawrence College, Murree.Since the Independence of Pakistan in 1947, Murree has retained its position as a popular hill station, noted for its pleasant summer weather. Many tourists visit the town from the Islamabad-Rawalpindi area. The town also serves as a transit point for tourists visiting Azad Kashmir and Abbottabad.The town is noted for its Tudorbethan and neo-gothic architecture. The Government of Pakistan owns a summer retreat in Murree, where foreign dignitaries including heads of state often visit.",
      "userId": 1,
      "id": 1
    },
    {
      "userId": 2,
      "id": 2,
      "title": "qui est esse",
      "body": "lorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimuslorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimuslorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimuslorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimus qui neque nisi nulla"
    },
    {
      "title": "ea molestias quasi omer",
      "body": "et ilorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimuslorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimuslorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimususto sed quo iure\nvoluptatem occaecati omnis eligendi aut ad\nvoluptatem doloribus vel accusantium quis pariatur\nmolestiae porro eius odio et labore et velit aut",
      "userId": 1,
      "id": 3
    },
    {
      "userId": 2,
      "id": 5,
      "title": "nesciunt quas odio",
      "body": "repudilorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimuslorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimuslorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimusandae veniam quaerat sunt sed\nalias aut fugiat sit autem sed est\nvoluptatem omnis possimus esse voluptatibus quis\nest aut tenetur dolor neque"
    },
    {
      "userId": 2,
      "id": 6,
      "title": "dolorem eum magni quia",
      "body": "ut asplorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimuslorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimuslorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimusernatur corporis harum nihil quis provident sequi\nmollitia nobis aliquid molestiae\nperspiciatis et ea nemo ab reprehenderit accusantium quas\nvoluptate dolores velit et doloremque molestiae"
    },
    {
      "userId": 1,
      "id": 7,
      "title": "magnam facilis autem",
      "body": "dolorelorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimuslorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimuslorem est rerum tempore vitae\nsequi sint nihil reprehenderit dolor beatae ea dolores neque\nfugiat blanditiis voluptate porro vel nihil molestiae ut reiciendis\nqui aperiam non debitis possimus placeat quibusdam ea quo vitae\nmagni quis enim qui quis quo nemo aut saepe\nquidem repellat excepturi ut quia\nsunt ut sequi eos ea sed quas"
    },
    {
      "title": "Lahore",
      "body": "Lahore is not just all about bricks and mortar but it is an alive, pulsating city, rich with its own flavor of colorful festivals, traditions deeply influenced by the indomitable generous and hospitable spirit of the Lahoris. \"One who hasn’t seen Lahore, goes the ancient Punjabi saying, hasn’t been born!\"\n\nLahore is Queen of Cities; others are like a golden ring, she the diamond. In the 12th Century a poet imprisoned in Persia yearned for Lahore as for a woman: I want, some velvet form which emanates the fragrance of Lahore. For longing for Lahore heart and soul faint within me.\n\nFor ages Lahore has been a brilliant symbol of a gracious way of life. It had been the abode of great people, both in the spiritual as well as worldly realms. It has the imposing reflections of its Muslim builders wearing ambitions and cosmopolitan tastes. The complex variety of Lahore which has grown forms the wilderness, when Changez Khan’s orders destroyed its suburbs, to the 20th Century developments, is distinctive character of the city in various places and provides testimony to its cultural heritage. Lahore having been the seat of many imperial dynasties, possesses interesting historical reminiscences. There is a fascinating and colorful panorama of extraordinary mosques, mausoleums, forts, gardens and the like. The grandeur of Lahore cannot be solely attributed to its buildings, gardens, monuments and other historical places. Rather it is its atmosphere and ambience, its moods of joy and sorrow, fairs and funs, pains and pleasures, and above all the colorful life of its people which actually render impetus to the spirit and sole of Lahore.\n\nAncient names of the city were Laohur, Lauhure, Lahvar, Lahur. Lahore was founded in 1021 AD. Most important events in history of Lahore area are:\n\nConquered by Mehmood al Ghaznavvi 1021 AD\nProvincial Capital of Ghaznavid Empire\nConstruction of Wall 1556-1605\nSikh Rule 1767 - 1849\nBritish Rule up to 1947\nSanitation Committee was formed 1858\nLandmarks of the City\nA few prominent landmarks of the city are enlisted below:\n\nMinar-e-Pakistan\nJahangir Tomb\nBadshahi Masjid\nLahore Fort\nShalimar Garden\nMazar-e-lqbal\nJinnah Hall",
      "userId": 2,
      "id": 8
    },
    {
      "title": "Islamabad",
      "body": "The capital city of Pakistan, Islamabad is located in the northwest of the country on Potohar Plateau. This area has been significant in history for being a part of the crossroads of the Rawalpindi and the North West Frontier Province. The city was built in 1960 to replace Karachi as the Pakistani capital, which it has been since 1963. Due to Islamabad's proximity to Rawalpindi, they are considered sister cities.\n\nCompared to other cities of the country, Islamabad is a clean, spacious and quiet city with lots of greeneries. The site of the city has a history going back to the earliest human habitations in Asia. This area has seen the first settlement of Aryans from Central Asia, ancient caravans passing from Central Asia, and the massive armies of Tamerlane and Alexander.\n\nTo the north of the city you will find the Margalla Hills. Hot summers, monsoon rains and cold winters with sparse snowfall in the hills almost summarize the climate of this area. Islamabad also has a rich wildlife ranging from wild boars to leopards.\n\nAfter the formation of Pakistan in 1947, it was felt that a new and permanent Capital City had to be built to reflect the diversity of the Pakistani nation. It was considered pertinent to locate the new capital where it could be isolated from the business and commercial activity of the Karachi, and yet is easily accessible from the remotest corner of the country.\nA commission was accordingly set in motion in 1958, entrusted with the task of selecting a suitable site for the new capital with a particular emphasis on location, climate, logistics and defense requirements, aesthetics, and scenic and natural beauty.",
      "userId": 1,
      "id": 9
    },
    {
      "title": "Ahmed",
      "body": "Ahmed khan\nkakaokkm vokdkcm alkkcmmca odmdcaomksa",
      "userId": 1,
      "id": 10
    },
    {
      "title": "LAHAHHHA",
      "body": "mffmfmw:SF,;AMFMKSMA;FMLMFLKMAFMA",
      "userId": 1,
      "id": 11
    },
    {
      "title": "Test",
      "body": "Testing 123",
      "userId": 1,
      "id": 12
    },
    {
      "title": "Gujranwala",
      "body": "Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala Gujranwala ",
      "userId": 2,
      "id": 16
    },
    {
      "title": "AHmeeeeeeeeeeeeeeed",
      "body": "AJKKMC ksmavm;msamv svm sav kksvaavjamc a\n",
      "userId": 1,
      "id": 18
    },
    {
      "title": "aaa",
      "body": "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaawwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqql,,,,,,,,,,,,,,,,,,,,,,,,,ssssssssssssssssssssskkkkkkkkkkkkkkkkkkkkkkkkkkkkrrrrrrrrrrrrrrrrrrrrrrrrrr                 ccccccccccccccccccccccccccccccccccccmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmttttttttttttttttttttttttttttttttttttkkkkkkkkkkkkkkkkkkkkkkkkkkkwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww\n",
      "userId": 1,
      "id": 19
    }
  ],
  "users": [
    {
      "id": 1,
      "username": "omer",
      "email": "omer@atmail.com",
      "password": "A@a12345"
    },
    {
      "username": "bilal",
      "email": "bilal@atmail.com",
      "password": "ABC@abc111",
      "id": 2
    },
    {
      "username": "osama",
      "email": "osama@atmail.com",
      "password": "ABC@abc111",
      "id": 3
    }
  ]
}
